# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8-seg instance segmentation model. For Usage examples see https://docs.ultralytics.com/tasks/segment

# Parameters
nc: 2 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-seg.yaml' will call yolov8-seg.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 3, C3STR, [1024]]
  - [-1, 1, SPPF, [1024, 5]] # 9

# YOLOv8.0n head
head:
  - [ -1, 1, nn.Upsample, [ None, 2, "nearest" ] ]   # 1x256x40x40
  - [ [ -1, 6 ], 1, Concat, [ 1 ] ] # cat backbone P4  # # 1x384x40x40
  - [ -1, 3, C2f, [ 512 ] ] # 12                       1x128x40x40

  - [ -1, 1, nn.Upsample, [ None, 2, "nearest" ] ] #   1x128x80x80
  - [ [ -1, 4 ], 1, Concat, [ 1 ] ] # cat backbone P3    1x192x80x80
  - [ -1, 3, C2f, [ 256 ] ] # 15 (P3/8-small)          1x64x80x80

  - [ -1, 1, nn.Upsample, [ None, 2, "nearest" ] ]
  - [ [ -1, 2 ], 1, Concat, [ 1 ] ] # cat backbone P3
  - [ -1, 3, C2f, [ 128 ] ] # 18 (P3/8-small)        1x32x160x160
  - [-1, 1, CBAM, [128]]

  - [ -1, 1, Conv, [ 128, 3, 2 ] ]                  # 32 80 80
  - [ [ -1, 16 ], 1, Concat, [ 1 ] ] # cat backbone P3
  - [ -1, 3, C2f, [ 256 ] ] # 21 (P3/8-small)       1x64x80x80
  - [-1, 1, CBAM, [256]]

  - [ -1, 1, Conv, [ 256, 3, 2 ] ]                     #1x64x40x40
  - [ [ -1, 13 ], 1, Concat, [ 1 ] ] # cat head P4        #1x192x40x40
  - [ -1, 3, C2f, [ 512 ] ] # 24 (P4/16-medium)       #1x128x40x40
  - [-1, 1, CBAM, [512]]

  - [ -1, 1, Conv, [ 512, 3, 2 ] ]                     #1x128x20x20
  - [ [ -1, 10 ], 1, Concat, [ 1 ] ] # cat head P5        #1x384x20x20
  - [ -1, 3, C2f, [ 1024 ] ] # 27 (P5/32-large)       #1x256x20x20
  - [-1, 1, CBAM, [1024]]

  # - [[18, 21, 24, 27], 1, Segment, [nc, 32, 256]] # Segment(P3, P4, P5)
  - [[20, 24, 28, 32], 1, Segment, [nc, 32, 256]] # Segment(P3, P4, P5)
